grpc-vs-rest-microservice-fan-out-benchmark/load-tests/testing-results/250-RPS/REST.txt
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    19,050 |     3,297 |    15,753
> min response time (ms)                                                             |         4 |         4 |     8,626
> max response time (ms)                                                             |    60,003 |    13,172 |    60,003
> mean response time (ms)                                                            |    18,301 |     1,377 |    21,843
> response time std deviation (ms)                                                   |    16,685 |     2,277 |    16,219
> response time 50th percentile (ms)                                                 |    15,001 |        57 |    15,001
> response time 75th percentile (ms)                                                 |    15,002 |     2,209 |    15,003
> response time 95th percentile (ms)                                                 |    58,610 |     6,395 |    60,000
> response time 99th percentile (ms)                                                 |    60,002 |    10,998 |    60,001
> mean throughput (rps)                                                              |    158.75 |     27.48 |    131.28
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          2,295 (12.05%)
> OK: 800 ms <= t < 1200 ms                                                                                  24  (0.13%)
> OK: t >= 1200 ms                                                                                          978  (5.13%)
> KO                                                                                                     15,753 (82.69%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     13,211 (83.86%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,409 (15.29%)
> status.find.is(200), found 500                                                                            133  (0.84%)
========================================================================================================================